chengping1970/STM8S207/sw_i2c.c
	for (count = 0;count < 8;count++)
	{
		if (value&0x80)
		{
			GPIO_WriteHigh(IIC_SDA_PORT,IIC_SDA_PIN);
		}
		else
		{
			GPIO_WriteLow(IIC_SDA_PORT,IIC_SDA_PIN);
		}
		_Delay_5us();
		GPIO_WriteHigh(IIC_SCL_PORT,IIC_SCL_PIN);
		_Delay_5us();
		GPIO_WriteLow(IIC_SCL_PORT,IIC_SCL_PIN);
		value = value<<1;
	}
	GPIO_WriteHigh(IIC_SDA_PORT,IIC_SDA_PIN);
	GPIO_Init(IIC_SDA_PORT, IIC_SDA_PIN, GPIO_MODE_IN_FL_NO_IT);
	_Delay_5us();
	GPIO_WriteHigh(IIC_SCL_PORT,IIC_SCL_PIN);
	for (count = 0;count < IIC_ACK_TIMEOUT;count++)
	{
		if (GPIO_ReadInputPin(IIC_SDA_PORT, IIC_SDA_PIN) == 0)
		{
			GPIO_WriteLow(IIC_SCL_PORT,IIC_SCL_PIN);
			GPIO_Init(IIC_SDA_PORT, IIC_SDA_PIN, GPIO_MODE_OUT_OD_LOW_FAST);
			return IIC_OK;
		}
	}
	GPIO_WriteLow(IIC_SCL_PORT,IIC_SCL_PIN);
	GPIO_Init(IIC_SDA_PORT, IIC_SDA_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	
	return IIC_FAIL;
}

/*==========================================================================*/
static u8 _SWI2C_ReceiveByte(u8 send_ack)
{
	u8 count, read, value = 0;

	GPIO_Init(IIC_SDA_PORT, IIC_SDA_PIN, GPIO_MODE_IN_FL_NO_IT);
	for (count = 0;count < 8;count++)
	{
		_Delay_5us();
		GPIO_WriteHigh(IIC_SCL_PORT,IIC_SCL_PIN);
		if (GPIO_ReadInputPin(IIC_SDA_PORT, IIC_SDA_PIN))
		{
			read = 1;
		}
		else
		{
			read = 0;
		}
		value = (value<<1)|read;
		_Delay_5us();
		GPIO_WriteLow(IIC_SCL_PORT,IIC_SCL_PIN);
	}
	GPIO_Init(IIC_SDA_PORT, IIC_SDA_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	if (send_ack)
	{
		GPIO_WriteLow(IIC_SDA_PORT,IIC_SDA_PIN);
	}
	else
	{
		GPIO_WriteHigh(IIC_SDA_PORT,IIC_SDA_PIN);
	}
	_Delay_5us();
	GPIO_WriteHigh(IIC_SCL_PORT,IIC_SCL_PIN);
	_Delay_5us();
	GPIO_WriteLow(IIC_SCL_PORT,IIC_SCL_PIN);
	_Delay_5us();

	return	value;		
}
/*==========================================================================*/
static u8 SWI2C_GetSignalStatus(void)
{
	u8 p0_status;
	#if CHECK_SIGNAL_RESOLUTION
	u8 val;
	u16 HActive, VActive;
	#endif
	SWI2C_ReadByte(0x90, 0x0A, &p0_status);
	#if CHECK_SIGNAL_RESOLUTION
	SWI2C_ReadByte(0x90, 0x9F, &val);
	HActive = val&0x3F;
	HActive = HActive<<8;
	SWI2C_ReadByte(0x90, 0x9E, &val);
	HActive += val;
	SWI2C_ReadByte(0x90, 0xA4, &val);
	VActive = val&0xF0;
	VActive = VActive<<4;
	SWI2C_ReadByte(0x90, 0xA5, &val);
	VActive += val;
	#endif
	if ((p0_status&0x0C) == 0x0C)
	{
		#if CHECK_SIGNAL_RESOLUTION
		if (HActive == 1920 && VActive == 1080)
		#endif
		{
			return 1;
		}
	}
	
	return 0;
}
/*==========================================================================*/
#if WRITE_WEAVING_TABLE
#if WRITE_SHORT_TABLE
static const u16 weaving_table[] =
{
0x8018
,0x9017
,0x9017
,0x9016
,0x9015
,0x9014
,0x912C
,0x912B
,0x912B
,0x912A
,0x9129
,0x9128
,0x9240
,0x923F
,0x923F
,0x923E
,0x923D
,0x923C
,0x9354
,0x9353
,0x9353
,0x9352
,0x9351
,0x9350
,0x9468
,0x9467
,0x9467
,0x9466
,0x9465
,0x9464
,0x957C
,0x957B
,0x957B
,0x957A
,0x9579
,0x9578
,0x9690
,0x968F
,0x968F
,0x968E
,0x968D
,0x968C
,0x97A4
,0x97A3
,0x97A3
,0x97A2
,0x97A1
,0xA7A0
,0x102E
,0x200C
,0x3004
,0x4008
,0x502C
};
static void FPGA_WriteWeavingTable(void)
{
	u16 i;
	
	for (i = 0; i < sizeof(weaving_table)/2; i++)
	{
		SWI2C_Write2Byte(FPGA_ADDRESS, 0xC6, weaving_table[i]);
	}
}
#else
static const u8 weaving_table[] =
{
#include "weaving_default.txt"
};
static void FPGA_WriteWeavingTable(void)
{
	u16 i;
	
	SWI2C_WriteByte(FPGA_ADDRESS, 0x4A, FLASH_ReadByte(EEPROM_START_ADDRESS + 0x0A));
	SWI2C_WriteByte(FPGA_ADDRESS, 0xC6, 0x01);
	for (i = 0; i < sizeof(weaving_table); i++)
	{
		SWI2C_WriteByte(FPGA_ADDRESS, 0xC7, weaving_table[i]);
	}
	SWI2C_WriteByte(FPGA_ADDRESS, 0xC6, 0x02);
}
#endif
#endif
/*==========================================================================*/
#if TEST_WEAVING_TABLE
static const u8 test_weaving_table[4][] =
{
	{
		#include "weaving_pc.txt"
	},
	{
		#include "weaving_select.txt"
	},
	{
		#include "weaving_old.txt"
	},
	{
		#include "weaving_default.txt"
	}
};

void SWI2C_WriteWeavingTable(u8 index)
{
	u16 i;

	GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
	GPIO_WriteLow(LED_G_PORT, LED_G_PIN);
	SWI2C_WriteByte(FPGA_ADDRESS, 0x4A, FLASH_ReadByte(EEPROM_START_ADDRESS + 0x0A));
	SWI2C_WriteByte(FPGA_ADDRESS, 0xC6, 0x01);
	for (i = 0; i < 1028; i++)
	{
		SWI2C_WriteByte(FPGA_ADDRESS, 0xC7, test_weaving_table[index][i]);
	}
	SWI2C_WriteByte(FPGA_ADDRESS, 0xC6, 0x02);
	if (I2C_stop)
	{
		GPIO_WriteHigh(LED_R_PORT, LED_R_PIN);			
		GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
	}
	else
	{
		GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
		GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
	}
}
#endif
/*==========================================================================*/
u8 SWI2C_TestDevice(u8 addr)
{
	u8 result;
	_SWI2C_Start();
	result = _SWI2C_SendByte(addr);
	_SWI2C_Stop();

	return result;
}
/*==========================================================================*/
u8 SWI2C_ReadByte(u8 addr, u8 subaddr, u8 * pValue)
{
	return SWI2C_ReadBytes(addr, subaddr, 1, pValue);
}
/*==========================================================================*/
u8 SWI2C_ReadBytes(u8 addr, u8 subaddr, u8 number, u8 * p_data)
{	
	u8 result;
	_SWI2C_Start();
	result = _SWI2C_SendByte(addr);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(subaddr);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	_SWI2C_Start();
	result = _SWI2C_SendByte(addr|0x01);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	while (number--)
	{
		*p_data = _SWI2C_ReceiveByte(number);
		p_data++;
	}
	_SWI2C_Stop();

	return IIC_OK;
}
/*==========================================================================*/
u8 SWI2C_WriteByte(u8 addr, u8 subaddr, u8 value)
{	
	return SWI2C_WriteBytes(addr, subaddr, 1, &value);
}
/*==========================================================================*/
u8 SWI2C_Write2Byte(u8 addr, u8 subaddr, u16 data) 
{
	u8 result;
	_SWI2C_Start();                              
	result = _SWI2C_SendByte(addr);  
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(subaddr);     
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(data>>8);     
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(data);   
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	_SWI2C_Stop();    
	return IIC_OK;
}      
/*==========================================================================*/
u8 SWI2C_WriteBytes(u8 addr, u8 subaddr, u8 number, u8 * p_data)
{
	u8 result;
	_SWI2C_Start();
	result = _SWI2C_SendByte(addr);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	result = _SWI2C_SendByte(subaddr);
	if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
	while (number--)
	{
		result = _SWI2C_SendByte(*p_data);
		if (result == IIC_FAIL)
	{
		_SWI2C_Stop();
		return result;
	}
		p_data++;
	}
	_SWI2C_Stop();
	return IIC_OK;
}
/*==========================================================================*/
void SWI2C_VerifyKey(void)
{
#if	FPGA_KEY_VERIFY
	u8 secret_key[4], convert_key[4], secret_status;
	SWI2C_ReadByte(FPGA_ADDRESS, 0x19, &secret_status);
	if ((secret_status&0x03) == 1)
	{
		SWI2C_ReadBytes(FPGA_ADDRESS, 0x10, 4, secret_key);
		convert_key[0] = secret_key_table1[secret_key[0]];
		convert_key[1] = secret_key_table2[secret_key[1]];
		convert_key[2] = secret_key_table3[secret_key[2]];
		convert_key[3] = secret_key_table4[secret_key[3]];
		SWI2C_WriteBytes(FPGA_ADDRESS, 0x14, 4, convert_key);
		secret_status = secret_status|0x07;
		SWI2C_WriteByte(FPGA_ADDRESS, 0x19, secret_status);
	}
#endif
}
/*==========================================================================*/
void SWI2C_Init(void)
{
	GPIO_Init(IIC_SCL_PORT, IIC_SCL_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	GPIO_Init(IIC_SDA_PORT, IIC_SDA_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	GPIO_WriteHigh(IIC_SCL_PORT,IIC_SCL_PIN);
	GPIO_WriteHigh(IIC_SDA_PORT,IIC_SDA_PIN);

	GPIO_Init(POWER_ONOFF_PORT, POWER_ONOFF_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	
	GPIO_Init(FPGA_RESET_PORT, FPGA_RESET_PIN, GPIO_MODE_OUT_PP_LOW_FAST);	
	GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
	
	GPIO_Init(IT680X_RESET_PORT, IT680X_RESET_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	
	GPIO_Init(LED_R_PORT, LED_R_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);	
	GPIO_Init(LED_G_PORT, LED_G_PIN, GPIO_MODE_OUT_PP_LOW_FAST);

	GPIO_Init(HDMI_HOTPLUG_PORT, HDMI_HOTPLUG_PIN, GPIO_MODE_OUT_OD_HIZ_FAST);
	GPIO_WriteHigh(HDMI_HOTPLUG_PORT,HDMI_HOTPLUG_PIN);

	GPIO_Init(BACKLIGHT_ONOFF_PORT, BACKLIGHT_ONOFF_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_Init(BACKLIGHT_PWM_PORT, BACKLIGHT_PWM_PIN, GPIO_MODE_OUT_PP_HIGH_FAST);
	GPIO_Init(VPANEL_ONOFF_PORT, VPANEL_ONOFF_PIN, GPIO_MODE_OUT_PP_LOW_FAST);
	
	TIM1_TimeBaseInit(0, TIM1_COUNTERMODE_UP, 4095, 0);
	TIM1_OC1Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_DISABLE,
	           0, TIM1_OCPOLARITY_LOW, TIM1_OCNPOLARITY_HIGH, TIM1_OCIDLESTATE_SET,
	           TIM1_OCNIDLESTATE_RESET);
	TIM1_Cmd(ENABLE);
	TIM1_CtrlPWMOutputs(ENABLE);

