chengping1970/STM8S207/sw_i2c.c
}
/*==========================================================================*/
void SWI2C_Update(void)
{	
	if (Backlight_on_timer == TIMER_EXPIRED)
	{
		SET_BACKLIGHT_ON();
		Backlight_on_timer = TIMER_STOPPED;
		//SWI2C_ToggleI2CMode();
	}

	if (Power_status && !I2C_stop)
	{
		IT6802_fsm();

		/*if (frc_update_timer == TIMER_EXPIRED && Have_FRC)
		{
			u8 read_LVDS_mode, read_MFC;
			SWI2C_ReadByte(FRC_BOARD_ADDRESS, 0x18, &read_LVDS_mode);
			if (read_LVDS_mode != LVDS_mode)
			{
				SWI2C_WriteByte(FRC_BOARD_ADDRESS, 0x18, LVDS_mode);
			}
			SWI2C_ReadByte(FRC_BOARD_ADDRESS, 0x0A, &read_MFC);
			if (read_MFC != 0)
			{
				IR_DelayNMiliseconds(50);
				SWI2C_WriteByte(FRC_BOARD_ADDRESS, 0x0A, 0);
			}
			frc_update_timer = FRC_UPDATE_TIME;
		}*/	

#if FPGA_KEY_VERIFY_AUTO
		if (secret_detect_timer == TIMER_EXPIRED)
		{
			SWI2C_VerifyKey();
			secret_detect_timer = SECRET_DETECT_TIME;
		}
#endif
		if (signal_detect_timer == TIMER_EXPIRED)
		{
			
			u8 current_signal_status;
			
			signal_detect_timer = SINGNAL_TETECT_TIME;
			current_signal_status = SWI2C_GetSignalStatus();
			if (current_signal_status != signal_status)
			{
				singal_change_count++;
				if (current_signal_status && singal_change_count > SIGNAL_STABLE_COUNT)
				{
					signal_status = TRUE;
					GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
					SWI2C_FirstResetFPGA();
					SWI2C_ResetFPGA();
					SET_VPANEL_ON();
					Backlight_on_timer = BACKLIGHT_DELAY_TIME;
				}
				else if (!current_signal_status && singal_change_count > NO_SIGNAL_COUNT)
				{
					signal_status = FALSE;
					Backlight_on_timer = TIMER_STOPPED;
					SET_BACKLIGHT_OFF();
					IR_DelayNMiliseconds(200);
					SET_VPANEL_OFF();
					GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
				}
			}
			else
			{
				singal_change_count = 0;
			}			

			if (signal_status)
			{
				GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
			}
			else
			{
				GPIO_WriteReverse(LED_G_PORT, LED_G_PIN);
			}
		}	
	}
}
/*==========================================================================*/
static void SWI2C_ResetIT680x(void)
{
#if MHL_IIC_ERROR_RESET
	I2C_error_count = 0;
#endif
	GPIO_WriteLow(IT680X_RESET_PORT, IT680X_RESET_PIN);
	IR_DelayNMiliseconds(200);
	GPIO_WriteHigh(IT680X_RESET_PORT, IT680X_RESET_PIN);
	IR_DelayNMiliseconds(200);
	IT6802_fsm_init();
#if ENABLE_HDMI_HPD
	GPIO_WriteLow(HDMI_HOTPLUG_PORT,HDMI_HOTPLUG_PIN);
	IR_DelayNMiliseconds(2000);
	GPIO_WriteHigh(HDMI_HOTPLUG_PORT,HDMI_HOTPLUG_PIN);
#endif
}
/*==========================================================================*/
void SWI2C_SystemPowerUp(void)
{
	GPIO_WriteLow(POWER_ONOFF_PORT, POWER_ONOFF_PIN);
	GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
	GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
	DEBUG_PRINTF(printf("\r\n***** START UP, POWER ON *****\r\n"));
	onoff_count++;
	DEBUG_PRINTF(printf("***** COUNT %d *****\r\n", (onoff_count&0xFF)));
	IR_DelayNMiliseconds(50);
	Power_status = TRUE;	
	SWI2C_ResetIT680x();
	Have_FRC = SWI2C_TestDevice(FRC_BOARD_ADDRESS);
	singal_change_count = 0;
	signal_status = FALSE;
}
/*==========================================================================*/
void SWI2C_ResetFPGA(void)
{
	if (Power_status && (GPIO_ReadOutputData(FPGA_RESET_PORT) & FPGA_RESET_PIN))
	{		
		GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(200);
		GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(1500);
		FPGA_Init();
#if WRITE_WEAVING_TABLE
		FPGA_WriteWeavingTable();
#endif
	}
}
/*==========================================================================*/
void SWI2C_FirstResetFPGA(void)
{
	if (Power_status)
	{		
#if START_RESET_HDMI
		GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(200);
		GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(500);
		SWI2C_WriteByte(0x90, 0x14, 0xFF);
		IR_DelayNMiliseconds(1000);
		SWI2C_WriteByte(0x90, 0x14, 0x0);
#else
		GPIO_WriteHigh(FPGA_RESET_PORT, FPGA_RESET_PIN);
		IR_DelayNMiliseconds(200);
#endif
	}
}
/*==========================================================================*/
void SWI2C_SystemPowerDown(void)
{
	GPIO_WriteHigh(LED_R_PORT, LED_R_PIN);			
	GPIO_WriteLow(LED_G_PORT, LED_G_PIN);
	SET_BACKLIGHT_OFF();
	IR_DelayNMiliseconds(200);
	GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
	SET_VPANEL_OFF();
	GPIO_WriteHigh(POWER_ONOFF_PORT, POWER_ONOFF_PIN);
#if ENABLE_HDMI_HPD
	GPIO_WriteLow(HDMI_HOTPLUG_PORT,HDMI_HOTPLUG_PIN);
#endif
	DEBUG_PRINTF(printf("***** STANBY MODE, POWER OFF *****\r\n\r\n"));
	Backlight_on_timer = TIMER_STOPPED;
	Power_status = FALSE;
	I2C_stop = FALSE;
}
/*==========================================================================*/
void SWI2C_ToggleI2CMode(void)
{
	if (Power_status)
	{
		I2C_stop = !I2C_stop;
		if (I2C_stop)
		{
			GPIO_WriteHigh(LED_R_PORT, LED_R_PIN);			
			GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
		}
		else
		{
			{
				u8 value;
				SWI2C_ReadByte(FPGA_ADDRESS, 0xE2, &value);
				if (value == 0xFF)
				{
					SWI2C_ReadByte(FPGA_ADDRESS, 0x0D, &value);
					FLASH_ProgramByte(EEPROM_START_ADDRESS + 19, value);
					SWI2C_ReadByte(FPGA_ADDRESS, 0xC8, &value);
					FLASH_ProgramByte(EEPROM_START_ADDRESS + 2, value);
					SWI2C_ReadByte(FPGA_ADDRESS, 0xC9, &value);
					FLASH_ProgramByte(EEPROM_START_ADDRESS + 3, value);
					SWI2C_ReadByte(FPGA_ADDRESS, 0xCA, &value);
					FLASH_ProgramByte(EEPROM_START_ADDRESS + 4, value);
					SWI2C_ReadByte(FPGA_ADDRESS, 0xCB, &value);
					FLASH_ProgramByte(EEPROM_START_ADDRESS + 5, value);
					IR_DelayNMiliseconds(200);
					WWDG->CR |= 0x80;
					WWDG->CR &= ~0x40;
				}
				GPIO_WriteLow(LED_R_PORT, LED_R_PIN);			
				GPIO_WriteHigh(LED_G_PORT, LED_G_PIN);
			}
		}
	}
}
/*==========================================================================*/
void SWI2C_ProcessPower(void)
{
	if (Power_status)
	{
		SWI2C_SystemPowerDown();
	}
	else
	{
		SWI2C_SystemPowerUp();
	}
}
/*==========================================================================*/
static u8 Set3DOn = FALSE;

static void SWI2C_Set3DOnOff(u8 OnOff)
{
	u8 switch3D, insert, retry;
	SWI2C_ReadByte(FPGA_ADDRESS, 0x0D, &insert);
	#if SUPPORT_1080P_2DZ
	if (OnOff)
	{
		switch3D = 0x40;
	}
	else
	{
		switch3D = 0x0;
	}
	insert |= 0x20;
	#else
	if (OnOff)
	{
		switch3D = 0x40;
		insert &= 0xDF;
	}
	else
	{
		switch3D = 0x0;
		insert |= 0x20;
	}
	#endif
	for (retry = 0; retry < 3; retry++)
	{
		u8 value;
		SWI2C_WriteByte(FPGA_ADDRESS, 0x57, switch3D);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x0D, insert);
		SWI2C_ReadByte(FPGA_ADDRESS, 0x57, &value);
		if (value == switch3D)
		{
			break;
		}
	}
}
/*==========================================================================*/
void SWI2C_Toggle3DOnOff(void)
{	
	Set3DOn = !Set3DOn;
	SWI2C_Set3DOnOff(Set3DOn);
}
/*==========================================================================*/
void SWI2C_ToggleInsert(void)
{	
	u8 insert;
	SWI2C_ReadByte(FPGA_ADDRESS, 0x0D, &insert);
	if (insert&0x20)
	{
		insert &= 0xDF;
	}
	else
	{
		insert |= 0x20;
	}
	SWI2C_WriteByte(FPGA_ADDRESS, 0x0D, insert);
}
/*==========================================================================*/
extern const u8 address_table[];
extern const u8 table_size;

void FPGA_Init(void)
 {	
 	u8 i;
	for (i = 0; i < table_size; i++)
	{
		SWI2C_WriteByte(FPGA_ADDRESS, address_table[i], FLASH_ReadByte(EEPROM_START_ADDRESS + 1 + i));
	}
	if (FLASH_ReadByte(EEPROM_START_ADDRESS + 1))
	{
		Set3DOn = TRUE;
	}
	SWI2C_WriteByte(FPGA_ADDRESS, 0x19, 0x04);
	
