chengping1970/STM8S207/sw_i2c.c
#if SUPPORT_1080P_2DZ_ORI
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE0, 0x11);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE1, 0x32);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE2, 0x54);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE3, 0x7E);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE4, 0x00);
#else
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE0, 0x11);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE1, 0x32);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE2, 0x54);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE3, 0x76);
	SWI2C_WriteByte(FPGA_ADDRESS, 0xE4, 0x07);
#endif
	SWI2C_Set3DOnOff(Set3DOn);	
}
/*==========================================================================*/
void HDMI_HotPlug(u8 value)
{
	if (value)
	{
		GPIO_WriteHigh(HDMI_HOTPLUG_PORT,HDMI_HOTPLUG_PIN);
	}
	else
	{
		GPIO_WriteLow(HDMI_HOTPLUG_PORT,HDMI_HOTPLUG_PIN);
	}
}
/*==========================================================================*/
static const u8 deep_value[6][3] =
{
	//* 0x59 0x5C 0x5A 
	{0x30, 0x80, 0x60},
	{0x50, 0x70, 0x70},
	{0x70, 0x60, 0x80},
	{0x90, 0x50, 0x90},
	{0xA0, 0x40, 0xA0},
	{0xA8, 0x30, 0xA0},
	};
void SWI2C_Set_deep(u8 deep)
{
	if (deep == 0)
	{
		SWI2C_WriteByte(FPGA_ADDRESS, 0x59, FLASH_ReadByte(0x4000 + REG_0x59 + 1));
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5C, FLASH_ReadByte(0x4000 + REG_0x5C + 1));
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5A, FLASH_ReadByte(0x4000 + REG_0x5A + 1));
	}
	else
	{
		SWI2C_WriteByte(FPGA_ADDRESS, 0x59, deep_value[deep][0]);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5C, deep_value[deep][1]);
		SWI2C_WriteByte(FPGA_ADDRESS, 0x5A, deep_value[deep][2]);
	}
}
/*==========================================================================*/
#if MHL_IIC_ERROR_RESET
void SWI2C_ErrorProcess(void)
{
	I2C_error_count++;
	if (I2C_error_count > 50)
	{
		DEBUG_PRINTF(printf("I2C Error, RESET IT680x!!!"));
		signal_status = FALSE;
		singal_change_count = 0;
		Backlight_on_timer = TIMER_STOPPED;
		GPIO_WriteLow(FPGA_RESET_PORT, FPGA_RESET_PIN);
		SET_BACKLIGHT_OFF();
		IR_DelayNMiliseconds(200);
		SET_VPANEL_OFF();
		SWI2C_ResetIT680x();
	}
}
#endif
/*==========================================================================*/
void SWI2C_UpdateTimer(void)
{
	if (frc_update_timer > TIMER_EXPIRED)
	{
		frc_update_timer--;
	}
	
	if (Backlight_on_timer > TIMER_EXPIRED)
	{
		Backlight_on_timer--;
	}
#if FPGA_KEY_VERIFY_AUTO
	if (secret_detect_timer > TIMER_EXPIRED)
	{
		secret_detect_timer--;
	}	
#endif
	if (signal_detect_timer > TIMER_EXPIRED)
	{
		signal_detect_timer--;
	}		
}
/*==========================================================================*/

